docs/notes.org

* Introduction to the tools that will be used.
** git-annex.
*** intro.
   git-annex allows managing files with git, without checking the
   filecontents into git. While that may seem paradoxical, it is
   useful when dealing with files larger than git can currently
   easily handle, whether due to limitations in memory, time, or disk
   space.
   - In our framework, it will be used to keep hold of the multiple
     versions of the files that are used during the process of research
     and data analysis. It's imperative to keep track of the versions so
     as to facilitate the task when reproducing a result.
     (in this case most files are large and git-annex is the best at
     handling the size).
*** useful links.
   https://git-annex.branchable.com/walkthrough/
   https://git-annex.branchable.com/special_remotes/external/


** Zenodo.
*** intro.
    Zenodo is a general-purpose open-access repository developed under
    the European OpenAIRE program and operated by CERN. It allows
    researchers to deposit research papers, data sets, research
    software, reports, and any other research related digital
    artifacts.
    - We will be using Zenodo as the database where the articles and
      research papers will be deposited at the end of the mooc. The API
      is easily accessible through Python with the use of the package
      requests which allows the use of the basic HTTP queries.
*** useful links.
    https://developers.zenodo.org/#quickstart-upload

    
** Datalad.
*** intro.
    DataLad builds on top of git-annex and extends it with an
    intuitive command-line interface. It enables users to operate
    on data using familiar concepts, such as files and directories,
    while transparently managing data access and authorization with
    underlying hosting providers.
    A powerful and complete Python API is also provided to enable
    authors of data-centric applications to bring versioning and the
    fearless acquisition of data into continuous integration workflows.

*** additional functionalities to Git / git-annex.
    - minimize the use of unique/idiosyncratic functionality.
    - simplify working with repositories.
    - add a range of useful concepts and functions.
    - make the boundaries between repositories vanish from a user’s
      point of view.
    - provide users with the ability to act on “virtual” file paths.

*** key points.
    - DataLad manages your data, but it does not host it.
    - You can make DataLad publish file content to one location
      and afterwards automatically push an update to GitHub.
    - DataLad scales to large dataset sizes.
    - dataset = superdataset = subdataset unless it's registered
      in another dataset: sub / super.
    - Converting an existing Git or git-annex repository into a
      DataLad dataset: 	$ datalad create -f

*** exporting the content of a dataset as a ZIP archive to figshare.
    Ideally figshare should be supported as a proper git annex
    special remote. Unfortunately, figshare does not support having
    directories, and can store only a flat list of files. That makes
    it impossible for any sensible publishing of complete datasets.
    $ datalad export-to-figshare [-h] [-d DATASET] [--missing-content {error|continue|ignore}] [--no-annex] [--article-id ID] [PATH]	(*)

*** useful links.
    https://handbook.datalad.org/en/latest/basics/101-180-FAQ.html
    http://docs.datalad.org/en/stable/generated/man/datalad-export-to-figshare.html	 (*)
    http://handbook.datalad.org/en/latest/usecases/ml-analysis.html
    https://handbook.datalad.org/en/latest/beyond_basics/101-168-dvc.html

    
** Snakemake.
*** intro.
    Snakemake is a workflow engine that provides a readable
    Python-based workflow definition language and a powerful
    execution environment that scales from single-core workstations
    to compute clusters without modifying the workflow.
    - This will be used to handle the workflows in our project and
      and it's useful in the case of reproducibility because it allows
      the definition and the use of environments. For instance, we can
      define a seperate conda env in a rule in the Snakefile and
      we can inculde the packages we want to use while configurating
      the new conda environment (command: snakemake --use-env). 
*** useful links.
    https://snakemake.readthedocs.io/en/stable/
    https://snakemake.readthedocs.io/en/stable/tutorial/tutorial.html#tutorial
    https://www.youtube.com/watch?v=NNPBDOBHlxo&ab_channel=EdinburghGenomicsTraining
    https://snakemake.readthedocs.io/en/stable/snakefiles/deployment.html

    
** GUIX.
*** intro.
   "GNU GUIX is a general-purpose package manager that implements 
   the functional package management paradigm pioneered by Nix" (*). it
   allows the creation and the deployment of isolated software
   environments, operating systems and the maintaining of a large
   range of packages.
   - By definition, this software is a great addition to our arsenal
     in the subject of reproducible research. And among the many uses it
     has, tools like time-machine, for instance, allow the execution of
     old programmes. By finding the right version of the commit and
     installing these versions of dependencies, we can get back to a
     similar state to the old one and so, by executing the programme, we
     can get the same results.
*** useful links.
    https://link.springer.com/content/pdf/10.1007%2F978-3-319-27308-2_47.pdf (*)
    https://guix.gnu.org/manual/en/html_node/Binary-Installation.html
    https://guix.gnu.org/en/manual/en/guix.html

    
** Docker.
*** intro.
    Docker is a software for developing, shipping, and running
    applications. It allows the user to create seperate containers for
    their applications which seperates them from the infrastructure of
    the computer of the user and facilitates their use from other
    individuals.
    - Having a container which isolates the app from the environment
      and where the developper can state the packages and the versions
      that they want to use makes it possible for them to reproduce
      the same results. All they need to do is to create an image
      using a Dockerfile and to store it so as to be used to create a
      container whenever needed.

*** useful links.
   https://reproducible-analysis-workshop.readthedocs.io/en/latest/8.Intro-Docker.html

   
* The tutorials that were done in order get a better grasp of the tool.
** git-annex.
