docs/notes.tex
% Created 2021-05-20 jeu. 13:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{oumaima}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={oumaima},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Introduction to the tools that will be used.}
\label{sec:org064e0de}
\subsection{git-annex.}
\label{sec:org6637abe}
\subsubsection{intro.}
\label{sec:org6fabc52}
git-annex allows managing files with git, without checking the
filecontents into git. While that may seem paradoxical, it is
useful when dealing with files larger than git can currently
easily handle, whether due to limitations in memory, time, or disk
space.
\begin{itemize}
\item In our framework, it will be used to keep hold of the multiple
versions of the files that are used during the process of research
and data analysis. It's imperative to keep track of the versions so
as to facilitate the task when reproducing a result.
(in this case most files are large and git-annex is the best at
handling the size).
\end{itemize}
\subsubsection{useful links.}
\label{sec:orgb4d9fa8}
\url{https://git-annex.branchable.com/walkthrough/}
\url{https://git-annex.branchable.com/special\_remotes/external/}


\subsection{Zenodo.}
\label{sec:orgfa39c40}
\subsubsection{intro.}
\label{sec:org3192ddb}
Zenodo is a general-purpose open-access repository developed under
the European OpenAIRE program and operated by CERN. It allows
researchers to deposit research papers, data sets, research
software, reports, and any other research related digital
artifacts.
\begin{itemize}
\item We will be using Zenodo as the database where the articles and
research papers will be deposited at the end of the mooc. The API
is easily accessible through Python with the use of the package
requests which allows the use of the basic HTTP queries.
\end{itemize}
\subsubsection{useful links.}
\label{sec:org235ef0f}
\url{https://developers.zenodo.org/\#quickstart-upload}


\subsection{Datalad.}
\label{sec:org0e663e4}
\subsubsection{intro.}
\label{sec:org08b5349}
DataLad builds on top of git-annex and extends it with an
intuitive command-line interface. It enables users to operate
on data using familiar concepts, such as files and directories,
while transparently managing data access and authorization with
underlying hosting providers.
A powerful and complete Python API is also provided to enable
authors of data-centric applications to bring versioning and the
fearless acquisition of data into continuous integration workflows.

\subsubsection{additional functionalities to Git / git-annex.}
\label{sec:orgc1cbde1}
\begin{itemize}
\item minimize the use of unique/idiosyncratic functionality.
\item simplify working with repositories.
\item add a range of useful concepts and functions.
\item make the boundaries between repositories vanish from a user’s
point of view.
\item provide users with the ability to act on “virtual” file paths.
\end{itemize}

\subsubsection{key points.}
\label{sec:orge8be0c0}
\begin{itemize}
\item DataLad manages your data, but it does not host it.
\item You can make DataLad publish file content to one location
and afterwards automatically push an update to GitHub.
\item DataLad scales to large dataset sizes.
\item dataset = superdataset = subdataset unless it's registered
in another dataset: sub / super.
\item Converting an existing Git or git-annex repository into a
DataLad dataset: 	\$ datalad create -f
\end{itemize}

\subsubsection{exporting the content of a dataset as a ZIP archive to figshare.}
\label{sec:org625c300}
Ideally figshare should be supported as a proper git annex
special remote. Unfortunately, figshare does not support having
directories, and can store only a flat list of files. That makes
it impossible for any sensible publishing of complete datasets.
\$ datalad export-to-figshare [-h] [-d DATASET] [--missing-content \{error|continue|ignore\}] [--no-annex] [--article-id ID] [PATH]	(*)

\subsubsection{useful links.}
\label{sec:org26540f8}
\url{https://handbook.datalad.org/en/latest/basics/101-180-FAQ.html}
\url{http://docs.datalad.org/en/stable/generated/man/datalad-export-to-figshare.html}  (*)
\url{http://handbook.datalad.org/en/latest/usecases/ml-analysis.html}
\url{https://handbook.datalad.org/en/latest/beyond\_basics/101-168-dvc.html}


\subsection{Snakemake.}
\label{sec:orgb231407}
\subsubsection{intro.}
\label{sec:org7de0758}
Snakemake is a workflow engine that provides a readable
Python-based workflow definition language and a powerful
execution environment that scales from single-core workstations
to compute clusters without modifying the workflow.
\begin{itemize}
\item This will be used to handle the workflows in our project and
and it's useful in the case of reproducibility because it allows
the definition and the use of environments. For instance, we can
define a seperate conda env in a rule in the Snakefile and
we can inculde the packages we want to use while configurating
the new conda environment (command: snakemake --use-env).
\end{itemize}
\subsubsection{useful links.}
\label{sec:org49341cc}
\url{https://snakemake.readthedocs.io/en/stable/}
\url{https://snakemake.readthedocs.io/en/stable/tutorial/tutorial.html\#tutorial}
\url{https://www.youtube.com/watch?v=NNPBDOBHlxo\&ab\_channel=EdinburghGenomicsTraining}
\url{https://snakemake.readthedocs.io/en/stable/snakefiles/deployment.html}


\subsection{GUIX.}
\label{sec:orge1c2e84}
\subsubsection{intro.}
\label{sec:org68e4c78}
"GNU GUIX is a general-purpose package manager that implements 
the functional package management paradigm pioneered by Nix" (*). it
allows the creation and the deployment of isolated software
environments, operating systems and the maintaining of a large
range of packages.
\begin{itemize}
\item By definition, this software is a great addition to our arsenal
in the subject of reproducible research. And among the many uses it
has, tools like time-machine, for instance, allow the execution of
old programmes. By finding the right version of the commit and
installing these versions of dependencies, we can get back to a
similar state to the old one and so, by executing the programme, we
can get the same results.
\end{itemize}
\subsubsection{useful links.}
\label{sec:org13689ee}
\url{https://link.springer.com/content/pdf/10.1007\%2F978-3-319-27308-2\_47.pdf} (*)
\url{https://guix.gnu.org/manual/en/html\_node/Binary-Installation.html}
\url{https://guix.gnu.org/en/manual/en/guix.html}


\subsection{Docker.}
\label{sec:org14bcd89}
\subsubsection{intro.}
\label{sec:org76439f1}
Docker is a software for developing, shipping, and running
applications. It allows the user to create seperate containers for
their applications which seperates them from the infrastructure of
the computer of the user and facilitates their use from other
individuals.
\begin{itemize}
\item Having a container which isolates the app from the environment
and where the developper can state the packages and the versions
that they want to use makes it possible for them to reproduce
the same results. All they need to do is to create an image
using a Dockerfile and to store it so as to be used to create a
container whenever needed.
\end{itemize}

\subsubsection{useful links.}
\label{sec:org2a17d8e}
\url{https://reproducible-analysis-workshop.readthedocs.io/en/latest/8.Intro-Docker.html}


\section{The tutorials that were done in order get a better grasp of the tool.}
\label{sec:orgd36c39f}
