docs/notes.org
*** useful commands.
    - creating a repository:
      #+BEGIN_EXAMPLE
      git init 
      git annex init
      #+END_EXAMPLE
    
    - adding files:
      #+BEGIN_EXAMPLE
      git annex add .
      git commit -a -m added
      #+END_EXAMPLE

    - adding a remote (usb drive):
      #+BEGIN_EXAMPLE
      sudo mount /media/usb
      cd /media/usb
      git clone ~/annex
      cd annex
      git annex init "portable USB drive"
      git remote add laptop ~/annex
      cd ~/annex
      git remote add usbdrive /media/usb/annex
      #+END_EXAMPLE

    - getting file content:
      #+BEGIN_EXAMPLE
      cd /media/usb/annex
      git annex sync laptop
      git annex get .
      #+END_EXAMPLE

    - syncing:
      #+BEGIN_EXAMPLE
       cd /media/usb/annex
       git annex sync
      #+END_EXAMPLE

    - removing files:
      #+BEGIN_EXAMPLE
       git annex drop iso/debian.iso
      #+END_EXAMPLE

*** useful links.
    https://git-annex.branchable.com/walkthrough/
    https://git-annex.branchable.com/special_remotes/external/


** Zenodo.
*** Uploading through the API.
**** with cURL:
    - LINK: https://felipecrp.github.io/2021/01/01/uploading-to-zenodo-through-api.html
    - PROCESS:
      + We tested to see if the API is accessible by using a GET
        request and there wasn't an error message.
      + We then sent a POST request to the API to request the creation
	of a new deposit which we will be using to upload our files
	later on. We then receive a JSON message confirming the
        creation of the deposit and extra information (date, title, owner, ..).
      + We then sent a PUT request to upload the files in the deposit
        using the bucket link that was sent in the JSON message when
        we created the deposit.
      + Once we finish uploading the files, we can check the deposit
        to see if they have been uploaded. I did the test twice and
	uploaded simple .txt files (zenodotest.txt & zenodotest2.txt)
	and they are accessible via this URL: https://zenodo.org/api/files/4aefd393-ed38-489c-bc8c-2413d9cb160f/zenodotest2.txt?access_token=WgYPkomVp1HpJniDmwS2ylFBhwsNpntxFzKqo02HGij94nVFlO0tAefboqtn

**** with Python:
    - LINK: https://developers.zenodo.org/?python#quickstart-upload
    - PROCESS:
      + The process is similar to the last one. We first import the
	package requests which we will be using to send the HTTP
	requests to the browser, and then we use a GET request to
	access the deposit (while giving an authentication key with
	the right access). 
      + We then send a POST request to create a new deposit and we
	get in return a message containing information about this
	new deposit (id, links, ..).
      + Now, we can finally create new uploads. We first fetch the
	bucket URL by using this command which retrieves the item
	corresponding to the key "bucket" in the "links" dictionary.
     #+BEGIN_EXAMPLE
bucket_url = r.json()["links"]["bucket"]
      #+END_EXAMPLE

	We use the method PUT to upload out file into the deposit.
	I did that using the new API. 
*** Uploading through the website:
    I also tested how to publish an article and save it in the
    database. To do this, I simply used the sandbox and uploaded
    a report I worked on with an other student last year.

    
** Snakemake.
   I created a simple Snakefile in which I wrote a couple rules with
   shell commands and tried to compile some old projects in order to
   test this tool. 
   - LINK:
     https://www.youtube.com/watch?v=hPrXcUUp70Y&ab_channel=NCSAatIllinois

     
** Docker.
   In the case of Docker, I've alredy used this tool during the
   project of the semester 8 and so I have a grasp on its basic
   usage. I've already manipulated existing images and deployed
   containers either separately or in groups using docker-compose.
   In the case of creating new images, I've tried creating some using
   simple Dockerfiles.

   
* An introduction to Reproducible Research.
  It is the practice of having the flow of research documented in all
  of its steps in order to get the same result even if it's retested
  by other researchers or in the future. It relies on many components
  of the scientific study such as: having accessible data, detailed
  research and analysis, reproducible workflows and evironments, ..
  - The main features that need to be present for a scientific
    research to be reproductibility-friendly:
    + WF specification: connected tools steps of the analysis.
    + WF execution: provenence modules, data management, ..
    + WF environment: companion tools like Virtual machines, containers, ..

* A look into GUIX and reproducible software environments.
** Link:
  https://link.springer.com/content/pdf/10.1007%2F978-3-319-27308-2_47.pdf
  Paper: /Reproducible and User-Controlled Software Environments in HPC
with Guix/ by _Ludovic Courtès_ and _Ricardo Wurmus_.

