docs/notes.tex
\subsection{git-annex.}
\label{sec:org9e47c2e}
\subsubsection{useful commands.}
\label{sec:orga87d312}
\begin{itemize}
\item creating a repository:
\begin{verbatim}
      git init 
      git annex init
\end{verbatim}

\item adding files:
\begin{verbatim}
      git annex add .
      git commit -a -m added
\end{verbatim}

\item adding a remote (usb drive):
\begin{verbatim}
      sudo mount /media/usb
      cd /media/usb
      git clone ~/annex
      cd annex
      git annex init "portable USB drive"
      git remote add laptop ~/annex
      cd ~/annex
      git remote add usbdrive /media/usb/annex
\end{verbatim}

\item getting file content:
\begin{verbatim}
      cd /media/usb/annex
      git annex sync laptop
      git annex get .
\end{verbatim}

\item syncing:
\begin{verbatim}
       cd /media/usb/annex
       git annex sync
\end{verbatim}

\item removing files:
\begin{verbatim}
       git annex drop iso/debian.iso
\end{verbatim}
\end{itemize}

\subsubsection{useful links.}
\label{sec:orgedfc3d9}
\url{https://git-annex.branchable.com/walkthrough/}
\url{https://git-annex.branchable.com/special\_remotes/external/}


\subsection{Zenodo.}
\label{sec:orgb67670f}
\subsubsection{Uploading through the API.}
\label{sec:org4c83b54}
\begin{enumerate}
\item with cURL:
\label{sec:orgf7469a1}
\begin{itemize}
\item LINK: \url{https://felipecrp.github.io/2021/01/01/uploading-to-zenodo-through-api.html}
\item PROCESS:
\begin{itemize}
\item We tested to see if the API is accessible by using a GET
request and there wasn't an error message.
\item We then sent a POST request to the API to request the creation
of a new deposit which we will be using to upload our files
later on. We then receive a JSON message confirming the
creation of the deposit and extra information (date, title, owner, ..).
\item We then sent a PUT request to upload the files in the deposit
using the bucket link that was sent in the JSON message when
we created the deposit.
\item Once we finish uploading the files, we can check the deposit
to see if they have been uploaded. I did the test twice and
uploaded simple .txt files (zenodotest.txt \& zenodotest2.txt)
and they are accessible via this URL: \url{https://zenodo.org/api/files/4aefd393-ed38-489c-bc8c-2413d9cb160f/zenodotest2.txt?access\_token=WgYPkomVp1HpJniDmwS2ylFBhwsNpntxFzKqo02HGij94nVFlO0tAefboqtn}
\end{itemize}
\end{itemize}

\item with Python:
\label{sec:org8680c92}
\begin{itemize}
\item LINK: \url{https://developers.zenodo.org/?python\#quickstart-upload}
\item PROCESS:
\begin{itemize}
\item The process is similar to the last one. We first import the
package requests which we will be using to send the HTTP
requests to the browser, and then we use a GET request to
access the deposit (while giving an authentication key with
the right access).
\item We then send a POST request to create a new deposit and we
get in return a message containing information about this
new deposit (id, links, ..).
\item Now, we can finally create new uploads. We first fetch the
bucket URL by using this command which retrieves the item
corresponding to the key "bucket" in the "links" dictionary.
\end{itemize}
\begin{verbatim}
bucket_url = r.json()["links"]["bucket"]
\end{verbatim}

We use the method PUT to upload out file into the deposit.
I did that using the new API.
\end{itemize}
\end{enumerate}
\subsubsection{Uploading through the website:}
\label{sec:orgc85108f}
I also tested how to publish an article and save it in the
database. To do this, I simply used the sandbox and uploaded
a report I worked on with an other student last year.


\subsection{Snakemake.}
\label{sec:orgd19ddf0}
I created a simple Snakefile in which I wrote a couple rules with
shell commands and tried to compile some old projects in order to
test this tool. 
\begin{itemize}
\item LINK:
\url{https://www.youtube.com/watch?v=hPrXcUUp70Y\&ab\_channel=NCSAatIllinois}
\end{itemize}


\subsection{Docker.}
\label{sec:orgc84856c}
In the case of Docker, I've alredy used this tool during the
project of the semester 8 and so I have a grasp on its basic
usage. I've already manipulated existing images and deployed
containers either separately or in groups using docker-compose.
In the case of creating new images, I've tried creating some using
simple Dockerfiles.


\section{An introduction to Reproducible Research.}
\label{sec:org4490f56}
It is the practice of having the flow of research documented in all
of its steps in order to get the same result even if it's retested
by other researchers or in the future. It relies on many components
of the scientific study such as: having accessible data, detailed
research and analysis, reproducible workflows and evironments, ..
\begin{itemize}
\item The main features that need to be present for a scientific
research to be reproductibility-friendly:
\begin{itemize}
\item WF specification: connected tools steps of the analysis.
\item WF execution: provenence modules, data management, ..
\item WF environment: companion tools like Virtual machines, containers, ..
\end{itemize}
\end{itemize}

\section{A look into GUIX and reproducible software environments.}
\label{sec:org0afe8a1}
\subsection{Link:}
\label{sec:org98fa5a5}
  \url{https://link.springer.com/content/pdf/10.1007\%2F978-3-319-27308-2\_47.pdf}
  Paper: \emph{Reproducible and User-Controlled Software Environments in HPC
with Guix} by \uline{Ludovic Courtès} and \uline{Ricardo Wurmus}.
