docs/notes.tex

\subsection{Notes.}
\label{sec:org09f5943}
\begin{itemize}
\item "GNU GUIX is a general-purpose package manager that implements the
\end{itemize}
functional package management paradigm pioneered by Nix".

\begin{itemize}
\item It's important to handle the software environments when trying to
work on reproducible research because the work that is being done
mainly focuses on workflows, conventions, \ldots{} . We need to have
the same  software environment to be able to reproduce the same results.
\item A solution that was first given is to either write down the
numbers of the dependencies (insufficient), or to save/download
and reuse full system images (the images are large + it's
difficult to combine with the software environment of each of
the users). -> GUIX is the sollution to these problems.
\item Reproducing the exact same software environment on a different HPC
system could allow the users to assess the impact of the hardware
on the software’s performance + it would allow other researchers
to reproduce the same experiment on their systems.
\item Package managers like APT / RPM suffer from limitations:
\begin{itemize}
\item Package binaries that every user installs, such as .deb
files, are actually built on the package maintainer’s
machine, and details about the host may leak into the
binary that is uploaded.
\item While it is possible for users to define their own variant
of a package, it's still difficult to do. For instance,
even if a user builds a custom .spec file, they can't always
register it in the yumdb database (it's only allowed for
the administrator) so it's difficult for the user to track
down and register the complete graph of dependencies manually.
\item These tools implement an imperative and stateful package
management model: imperative in the sense that it modifies
the set of available packages in place (ex: switching to an
alternative MPI implementation, or upgrading the OpenMP
run-time library means that suddenly all the installed
applications and libraries start using them). It is stateful
because the system state at a given point in time is the
result of the series of installation and upgrade operations
that have been made over time, and there may be no way to
reproduce the exact same state elsewhere.
\end{itemize}

\item Package management is to be seen as functional paradigms where the
results only depend on the inputs. So, rerunning a given build
with the same input should result in bit-identical files (used
by Nix and now by Guix). A tool that is used is chroot which
allows them to run in a limited environment with a defined set
of env variables, a dedicated user ID, separate name spaces for
PIDs, inter-process communication (IPC), networking, \ldots{} This is
so as to ensure that build can't end up using libraries it's not
supposed to use -> this is what allows this process to be seen as
pure functions with reproducible results.
\item After each build, the created files are stored in the /gnu/store
directory. each entry has a name that includes a hash of all the
inputs of the build process that led to it (libs, compilers, ..).
Therefore, we can fetch the diagram of dependencies easily in this
case. After running 'guix build openmpi' for instance, we get as a
return the directory name /gnu/store/xx-openmpi-1.8.1. and the
daemon spawns the build process in an isolated environment (if
the directory doesn't exist). For the normal user, the command
'guix package' is enough to install the packages without  typing
out the long names. In fact, this command creates a symbolic link
to the selected /gnu/store item and the symbolic link is then
stored in  \textasciitilde{} /.guix-profile.
\end{itemize}
\end{document}